src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_События/бир_События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_События</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Момент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </resources>
  <resources>
    <name>ИдПервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипИсточника</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаВозникновения</name>
    <type>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRoutePointRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_СобытияОбработка/бир_СобытияОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_СобытияОбработка</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультатОбработки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаВозникновения</name>
    <type>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.бир_СобытияОбработчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_СобытияОбработкаНаКлиенте/бир_СобытияОбработкаНаКлиенте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_СобытияОбработкаНаКлиенте</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультатОбработки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаВозникновения</name>
    <type>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.бир_СобытияОбработчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_События/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 И Замещение И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Ид.Значение) Тогда
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ид.Установить(ЭтотОбъект.Отбор.Ид.Значение);
		НаборЗаписей.Записать(Истина);
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработкаНаКлиенте.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ид.Установить(ЭтотОбъект.Отбор.Ид.Значение);
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
